package dev.PavelEA.GoS.servlet.utility;


import java.util.HashMap;
import java.util.Map;

    public class AnswerConstructor {
        public static Map<Integer, String> answer = new HashMap();
        private static final String ANSWER_1 = "Обследовать местность! Необходимо быть уверенным в безопастности!";
        private static final String ANSWER_2 = "Добыть еды! Отправится за пределы деревушки и начать охоту!";
        private static final String ANSWER_3 = "Запастись дровами! Буря обещает быть очень холодной, нам необходимо тепло";
        private static final String ANSWER_4 = "В самой деревне безопастно, возвращаемся назад!";
        private static final String ANSWER_5 = "Нужно проверить эти дома. Аккуратно идем к ним!";
        private static final String ANSWER_6 = "Собираем все в округе! Обязательно возьмем то, что осталось от радиостанции, попробуем ее восстановить!";
        private static final String ANSWER_7 = "Все отправляемся по следам, ищем животных! К деревьям вернемся позже!";
        private static final String ANSWER_8 = "Разделимся! Те, кто с топопрами останутся рубить, остальные по следам!";
        private static final String ANSWER_9 = "Сделаем то, зачем мы сюда пришли! Собираем все, что горит!";
        private static final String ANSWER_10 = "Идем дальше по лесу! Всем быть на чеку!";
        private static final String ANSWER_11 = "Выходим в поле! Всем смотреть по сторонам!";
        private static final String ANSWER_12 = "Есть время для исследования лесопилки! Если мы сможем найти там дрова, то не замерзнем во время бури!";
        private static final String ANSWER_13 = "Ночь на дворе! Идем в убежище!";
        private static final String ANSWER_14 = "Ничего не трогаем, уходим! Лучше соберем что сможем по дороге в убежище!";
        private static final String ANSWER_15 = "Берем сколько сможем и валим!";
        private static final String ANSWER_16 = "Теперь это наш дом, берите что хотите!";
        private static final String ANSWER_17 = "Неизвестно когда начнется буря! Остаемся пережидать!";
        private static final String ANSWER_18 = "Нужно попробовать завести автомобиль! Толкаем все вместе!";
        private static final String ANSWER_19 = "Сейчас это авто просто металлолом! Заберите все что можно и возвращаемся домой!";
        private static final String ANSWER_20 = "Переносим все дрова в убежище и можно будет пережить бурю!";
        private static final String ANSWER_21 = "Возвращаемся в лес, идем по следам!";
        private static final String ANSWER_22 = "Мы можем притащить пикап сюда и попробовать починить!";
        private static final String ANSWER_23 = "Нужно найти бензин для пикапа, тогда мы сможем уехать в Рассвет!";
        private static final String ANSWER_24 = "Нужно исследовать край этой деревни! Там мы можем найти все, что нам нужно для выживания!";
        private static final String ANSWER_25 = "Нужно ехать к Рассвету прямо сейчас! Если не хватит бензина, бросим машину и пойдем пешком!";
        private static final String ANSWER_26 = "Укрепляем убежище! Основная задача теперь - это выжить во время бури!";
        private static final String ANSWER_27 = "Мы можем собрать все, что видели в деревне! Там есть антенна, и уверен, в домах найдется еще много полезных вещей!";
        private static final String ANSWER_28 = "Давайте изучим эти строения!";
        private static final String ANSWER_29 = "Делимся! Одна половина собирает припасы и материалы, что есть в округе! Вторая охраняет убежище!";
        private static final String ANSWER_30 = "Нужно проверить что происходит в том лагере!";
        private static final String ANSWER_31 = "Ночью я слышал вой волков! Нужно проверить, что в нашей деревне их нет!";
        private static final String ANSWER_32 = "Возвращаемся! Буря может начаться с минуты на минуту!";
        private static final String ANSWER_33 = "Продолжаем поиски, нам нужна еда! Разделимся и пойдем в разные стороны! ";


        public static void createAnswers() {
            answer.put(1, "Обследовать местность! Необходимо быть уверенным в безопастности!");
            answer.put(2, "Добыть еды! Отправится за пределы деревушки и начать охоту!");
            answer.put(3, "Запастись дровами! Буря обещает быть очень холодной, нам необходимо тепло");
            answer.put(4, "В самой деревне безопастно, возвращаемся назад!");
            answer.put(5, "Нужно проверить эти дома. Аккуратно идем к ним!");
            answer.put(6, "Собираем все в округе! Обязательно возьмем то, что осталось от радиостанции, попробуем ее восстановить!");
            answer.put(7, "Все отправляемся по следам, ищем животных! К деревьям вернемся позже!");
            answer.put(8, "Разделимся! Те, кто с топопрами останутся рубить, остальные по следам!");
            answer.put(9, "Сделаем то, зачем мы сюда пришли! Собираем все, что горит!");
            answer.put(10, "Идем дальше по лесу! Всем быть на чеку!");
            answer.put(11, "Выходим в поле! Всем смотреть по сторонам!");
            answer.put(12, "Есть время для исследования лесопилки! Если мы сможем найти там дрова, то не замерзнем во время бури!");
            answer.put(13, "Ночь на дворе! Идем в убежище!");
            answer.put(14, "Ничего не трогаем, уходим! Лучше соберем что сможем по дороге в убежище!");
            answer.put(15, "Берем сколько сможем и валим!");
            answer.put(16, "Теперь это наш дом, берите что хотите!");
            answer.put(17, "Неизвестно когда начнется буря! Остаемся пережидать!");
            answer.put(18, "Нужно попробовать завести автомобиль! Толкаем все вместе!");
            answer.put(19, "Сейчас это авто просто металлолом! Заберите все что можно и возвращаемся домой!");
            answer.put(20, "Переносим все дрова в убежище и можно будет пережить бурю!");
            answer.put(21, "Возвращаемся в лес, идем по следам!");
            answer.put(22, "Мы можем притащить пикап сюда и попробовать починить!");
            answer.put(23, "Нужно найти бензин для пикапа, тогда мы сможем уехать в Рассвет!");
            answer.put(24, "Нужно исследовать край этой деревни! Там мы можем найти все, что нам нужно для выживания!");
            answer.put(25, "Нужно ехать к Рассвету прямо сейчас! Если не хватит бензина, бросим машину и пойдем пешком!");
            answer.put(26, "Укрепляем убежище! Основная задача теперь - это выжить во время бури!");
            answer.put(27, "Мы можем собрать все, что видели в деревне! Там есть антенна, и уверен, в домах найдется еще много полезных вещей!");
            answer.put(28, "Давайте изучим эти строения!");
            answer.put(29, "Делимся! Одна половина собирает припасы и материалы, что есть в округе! Вторая охраняет убежище!");
            answer.put(30, "Нужно проверить что происходит в том лагере!");
            answer.put(31, "Ночью я слышал вой волков! Нужно проверить, что в нашей деревне их нет!");
            answer.put(32, "Возвращаемся! Буря может начаться с минуты на минуту!");
            answer.put(33, "Продолжаем поиски, нам нужна еда! Разделимся и пойдем в разные стороны! ");
        }

        public static String getAnswer(Integer number) {
            return answer.get(number);
        }
    }

